chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
#include "lwip/sys.h"
#include "lwip/tcpip.h"
#include "network_events.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"
#include "eth_ipstack_main.h"
#include "ethif_mac.h"

#include "bsp_ethernet.h"
#include "hal_mac_async.h"
#include "hal_gpio.h"
#include "printf.h"
#include "ieee8023_mii_standard_config.h"
#include "ieee8023_mii_standard_register.h"
#include "same54p20a.h"
#include <string.h>
#include <hri_mclk_e54.h>
#include <hri_gclk_e54.h>
#include "app_libs/asf4/hri/hri_gmac_e54.h"

/* Redefine ASF4 ERR_TIMEOUT after lwIP to avoid conflicts */
#undef ERR_TIMEOUT
#define ASF4_ERR_TIMEOUT -8

#include "utils_assert.h"

/* Forward declaration of gmac_device - moved from webserver_tasks.h for encapsulation */
typedef struct tag_gmac_device {
    /** Reference to lwIP netif structure. */
    struct netif *netif;

#if NO_SYS == 0
    /** RX task notification semaphore. */
    sys_sem_t rx_sem;
#endif
} gmac_device;

/* Task constants - replicated from webserver_tasks.h to avoid dependency */
#define TASK_LED_STACK_SIZE (512 / sizeof(portSTACK_TYPE))
#define TASK_LED_TASK_PRIORITY (tskIDLE_PRIORITY + 1)
#define netifINTERFACE_TASK_STACK_SIZE 512
#define netifINTERFACE_TASK_PRIORITY (tskIDLE_PRIORITY + 2)

/* Local pin definitions (copied from atmel_start_pins.h to avoid dependency) */
#define PA12 GPIO(GPIO_PORTA, 12)
#define PA13 GPIO(GPIO_PORTA, 13)
#define PA14 GPIO(GPIO_PORTA, 14)
#define PA15 GPIO(GPIO_PORTA, 15)
#define PA17 GPIO(GPIO_PORTA, 17)
#define PA18 GPIO(GPIO_PORTA, 18)
#define PA19 GPIO(GPIO_PORTA, 19)
#define PC11 GPIO(GPIO_PORTC, 11)
#define PC12 GPIO(GPIO_PORTC, 12)
#define PC20 GPIO(GPIO_PORTC, 20)

/* Local PIN and MUX definitions for GMAC (extracted from same54p20a.h) */
#define PIN_PC11L_GMAC_GMDC            _L_(75)
#define MUX_PC11L_GMAC_GMDC            _L_(11)
#define PIN_PC12L_GMAC_GMDIO           _L_(76)
#define MUX_PC12L_GMAC_GMDIO           _L_(11)
#define PIN_PA13L_GMAC_GRX0            _L_(13)
#define MUX_PA13L_GMAC_GRX0            _L_(11)
#define PIN_PA12L_GMAC_GRX1            _L_(12)
#define MUX_PA12L_GMAC_GRX1            _L_(11)
#define PIN_PC20L_GMAC_GRXDV           _L_(84)
#define MUX_PC20L_GMAC_GRXDV           _L_(11)
#define PIN_PA15L_GMAC_GRXER           _L_(15)
#define MUX_PA15L_GMAC_GRXER           _L_(11)
#define PIN_PA18L_GMAC_GTX0            _L_(18)
#define MUX_PA18L_GMAC_GTX0            _L_(11)
#define PIN_PA19L_GMAC_GTX1            _L_(19)
#define MUX_PA19L_GMAC_GTX1            _L_(11)
#define PIN_PA14L_GMAC_GTXCK           _L_(14)
#define MUX_PA14L_GMAC_GTXCK           _L_(11)
#define PIN_PA17L_GMAC_GTXEN           _L_(17)
#define MUX_PA17L_GMAC_GTXEN           _L_(11)

/* Local PINMUX definitions */
#define PINMUX_PC11L_GMAC_GMDC     ((PIN_PC11L_GMAC_GMDC << 16) | MUX_PC11L_GMAC_GMDC)
#define PINMUX_PC12L_GMAC_GMDIO    ((PIN_PC12L_GMAC_GMDIO << 16) | MUX_PC12L_GMAC_GMDIO)
#define PINMUX_PA13L_GMAC_GRX0     ((PIN_PA13L_GMAC_GRX0 << 16) | MUX_PA13L_GMAC_GRX0)
#define PINMUX_PA12L_GMAC_GRX1     ((PIN_PA12L_GMAC_GRX1 << 16) | MUX_PA12L_GMAC_GRX1)
#define PINMUX_PC20L_GMAC_GRXDV    ((PIN_PC20L_GMAC_GRXDV << 16) | MUX_PC20L_GMAC_GRXDV)
#define PINMUX_PA15L_GMAC_GRXER    ((PIN_PA15L_GMAC_GRXER << 16) | MUX_PA15L_GMAC_GRXER)
#define PINMUX_PA18L_GMAC_GTX0     ((PIN_PA18L_GMAC_GTX0 << 16) | MUX_PA18L_GMAC_GTX0)
#define PINMUX_PA19L_GMAC_GTX1     ((PIN_PA19L_GMAC_GTX1 << 16) | MUX_PA19L_GMAC_GTX1)
#define PINMUX_PA14L_GMAC_GTXCK    ((PIN_PA14L_GMAC_GTXCK << 16) | MUX_PA14L_GMAC_GTXCK)
#define PINMUX_PA17L_GMAC_GTXEN    ((PIN_PA17L_GMAC_GTXEN << 16) | MUX_PA17L_GMAC_GTXEN)

/* External peripheral descriptors declaration (will be integrated) */
extern struct mac_async_descriptor COMMUNICATION_IO;

/* Network interface variables - now part of driver context */

// Convert ASF4 error codes to driver status
static drv_eth_status_t convert_error_code(int32_t asf4_error)
{
    switch (asf4_error) {
        case ERR_NONE:
            return DRV_ETH_STATUS_OK;
        case ERR_BUSY:
            return DRV_ETH_STATUS_BUSY;
        case ASF4_ERR_TIMEOUT:
            return DRV_ETH_STATUS_TIMEOUT;
        default:
            return DRV_ETH_STATUS_ERROR;
    }
}

typedef struct
{
    struct mac_async_descriptor *mac_desc;  // Pointer to MAC descriptor
    uint16_t phy_address;                   // PHY address on MDIO bus
    drv_eth_callback_t receive_callback;
    drv_eth_callback_t transmit_callback;
    
    // GMAC device context (moved from webserver_tasks.c)
    gmac_device gmac_dev;
    
    // Link status tracking
    bool link_up;
    volatile bool recv_flag;
    
    // Link monitoring task
    TaskHandle_t link_monitor_task;
    
    // PHY callbacks (formerly from PHY driver)
    drv_eth_callback_t phy_link_change_callback;
    drv_eth_callback_t phy_error_callback;
} drv_eth_hw_context_t;

static drv_eth_hw_context_t drv_eth_hw_context_communication = {
    .mac_desc = &COMMUNICATION_IO,  // Pointer to external MAC descriptor
    .phy_address = CONF_ETHERNET_PHY_0_IEEE8023_MII_PHY_ADDRESS,
    .receive_callback = NULL,
    .transmit_callback = NULL,
    .gmac_dev = {0},
    .link_up = false,
    .recv_flag = false,
    .link_monitor_task = NULL,
    .phy_link_change_callback = NULL,
    .phy_error_callback = NULL,
};

// Forward declarations of static functions
static void gmac_clock_init(void);
static void gmac_pin_init(void);
static void gmac_handler_cb(void);
static void gmac_task(void *pvParameters);
static void link_monitor_task(void *p);
static drv_eth_status_t drv_eth_init(const void *hw_context);
static drv_eth_status_t drv_eth_deinit(const void *hw_context);
static drv_eth_status_t drv_eth_enable(const void *hw_context);
static drv_eth_status_t drv_eth_disable(const void *hw_context);
static drv_eth_status_t drv_eth_phy_init(const void *hw_context);
static drv_eth_status_t drv_eth_phy_reset(const void *hw_context);
static drv_eth_status_t drv_eth_get_link_status(const void *hw_context, bool *link_up);
static drv_eth_status_t drv_eth_restart_autoneg(const void *hw_context);
static drv_eth_status_t drv_eth_read_phy_reg(const void *hw_context, uint16_t reg, uint16_t *value);
static drv_eth_status_t drv_eth_write_phy_reg(const void *hw_context, uint16_t reg, uint16_t value);
static drv_eth_status_t drv_eth_set_phy_powerdown(const void *hw_context, bool state);
static drv_eth_status_t drv_eth_set_phy_isolate(const void *hw_context, bool state);
static drv_eth_status_t drv_eth_set_phy_loopback(const void *hw_context, bool state);
static drv_eth_status_t drv_eth_set_phy_reg_bit(const void *hw_context, uint16_t reg, uint16_t mask);
static drv_eth_status_t drv_eth_clear_phy_reg_bit(const void *hw_context, uint16_t reg, uint16_t value);
static drv_eth_status_t drv_eth_register_callback(const void *hw_context, drv_eth_cb_type_t type, drv_eth_callback_t callback);
static drv_eth_status_t drv_eth_write(const void *hw_context, const uint8_t *data, uint32_t length);
static drv_eth_tcpip_init_done_fn drv_eth_get_tcpip_init_done_fn_impl(const void *hw_context);
static drv_eth_status_t drv_eth_start_link_monitor_impl(const void *hw_context);
static drv_eth_status_t drv_eth_stop_link_monitor_impl(const void *hw_context);

// Global Ethernet driver instance
drv_eth_t eth_communication = {
    .is_init = false,
    .is_enabled = false,
    .hw_context = &drv_eth_hw_context_communication,
    .init = drv_eth_init,
    .deinit = drv_eth_deinit,
    .enable = drv_eth_enable,
    .disable = drv_eth_disable,
    .phy_init = drv_eth_phy_init,
    .phy_reset = drv_eth_phy_reset,
    .get_link_status = drv_eth_get_link_status,
    .restart_autoneg = drv_eth_restart_autoneg,
    .read_phy_reg = drv_eth_read_phy_reg,
    .write_phy_reg = drv_eth_write_phy_reg,
    .set_phy_powerdown = drv_eth_set_phy_powerdown,
    .set_phy_isolate = drv_eth_set_phy_isolate,
    .set_phy_loopback = drv_eth_set_phy_loopback,
    .set_phy_reg_bit = drv_eth_set_phy_reg_bit,
    .clear_phy_reg_bit = drv_eth_clear_phy_reg_bit,
    .register_callback = drv_eth_register_callback,
    .write = drv_eth_write,
    .get_tcpip_init_done_fn = drv_eth_get_tcpip_init_done_fn_impl,
    .start_link_monitor = drv_eth_start_link_monitor_impl,
    .stop_link_monitor = drv_eth_stop_link_monitor_impl,
};

static drv_eth_status_t drv_eth_init(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
