chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
    printf("[ETH] Initializing GMAC clocks and pins\r\n");
    
    // Initialize GMAC clocks first
    gmac_clock_init();
    
    // Configure GMAC pins
    gmac_pin_init();
    
    // Initialize MAC with pointer to external descriptor
    int32_t result = mac_async_init(context->mac_desc, GMAC);
    if (result != ERR_NONE) {
        return convert_error_code(result);
    }
    
    printf("[ETH] MAC initialized successfully\r\n");
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_deinit(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_deinit(context->mac_desc);
    printf("[ETH] MAC deinitialized\r\n");
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_enable(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_enable(context->mac_desc);
    if (result == ERR_NONE) {
        printf("[ETH] MAC enabled\r\n");
    }
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_disable(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_disable(context->mac_desc);
    printf("[ETH] MAC disabled\r\n");
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_phy_init(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    printf("[ETH] Initializing PHY at address 0x%02X\r\n", context->phy_address);
    
    // Configure PHY with default settings
    int32_t result = mac_async_write_phy_reg(context->mac_desc, context->phy_address,
                                           MDIO_REG0_BMCR, CONF_ETHERNET_PHY_0_IEEE8023_MII_CONTROL_REG0);
    if (result != ERR_NONE) {
        printf("[ETH] Failed to configure PHY control register\r\n");
        return convert_error_code(result);
    }
    
    // Read and display PHY status for debugging
    uint16_t reg_value;
    if (mac_async_read_phy_reg(context->mac_desc, context->phy_address, 0, &reg_value) == ERR_NONE) {
        printf("[ETH] PHY Control Register: 0x%04X\r\n", reg_value);
    }
    if (mac_async_read_phy_reg(context->mac_desc, context->phy_address, 1, &reg_value) == ERR_NONE) {
        printf("[ETH] PHY Status Register: 0x%04X\r\n", reg_value);
    }
    if (mac_async_read_phy_reg(context->mac_desc, context->phy_address, 4, &reg_value) == ERR_NONE) {
        printf("[ETH] PHY Auto-negotiation Advertisement: 0x%04X\r\n", reg_value);
    }
    
    printf("[ETH] PHY initialized successfully\r\n");
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_phy_reset(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    printf("[ETH] Resetting PHY\r\n");
    
    int32_t result = mac_async_write_phy_reg(context->mac_desc, context->phy_address,
                                           MDIO_REG0_BMCR, MDIO_REG0_BIT_RESET);
    if (result == ERR_NONE) {
        printf("[ETH] PHY reset completed\r\n");
    }
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_get_link_status(const void *hw_context, bool *link_up)
{
    ASSERT(hw_context != NULL);
    ASSERT(link_up != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    uint16_t reg_value;
    int32_t result = mac_async_read_phy_reg(context->mac_desc, context->phy_address,
                                          MDIO_REG1_BMSR, &reg_value);
    if (result == ERR_NONE) {
        *link_up = (reg_value & MDIO_REG1_BIT_LINK_STATUS) ? true : false;
    }
    
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_restart_autoneg(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    
    printf("[ETH] Restarting auto-negotiation\r\n");
    
    // Use helper function to set the restart auto-negotiation bit
    return drv_eth_set_phy_reg_bit(hw_context, MDIO_REG0_BMCR, MDIO_REG0_BIT_RESTART_AUTONEG);
}

static drv_eth_status_t drv_eth_read_phy_reg(const void *hw_context, uint16_t reg, uint16_t *value)
{
    ASSERT(hw_context != NULL);
    ASSERT(value != NULL);
    ASSERT(reg <= 0x1F);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_read_phy_reg(context->mac_desc, context->phy_address, reg, value);
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_write_phy_reg(const void *hw_context, uint16_t reg, uint16_t value)
{
    ASSERT(hw_context != NULL);
    ASSERT(reg <= 0x1F);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_write_phy_reg(context->mac_desc, context->phy_address, reg, value);
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_set_phy_powerdown(const void *hw_context, bool state)
{
    ASSERT(hw_context != NULL);
    
    if (state) {
        return drv_eth_set_phy_reg_bit(hw_context, MDIO_REG0_BMCR, MDIO_REG0_BIT_POWER_DOWN);
    } else {
        return drv_eth_clear_phy_reg_bit(hw_context, MDIO_REG0_BMCR, MDIO_REG0_BIT_POWER_DOWN);
    }
}

static drv_eth_status_t drv_eth_set_phy_isolate(const void *hw_context, bool state)
{
    ASSERT(hw_context != NULL);
    
    if (state) {
        return drv_eth_set_phy_reg_bit(hw_context, MDIO_REG0_BMCR, MDIO_REG0_BIT_ISOLATE);
    } else {
        return drv_eth_clear_phy_reg_bit(hw_context, MDIO_REG0_BMCR, MDIO_REG0_BIT_ISOLATE);
    }
}

static drv_eth_status_t drv_eth_set_phy_loopback(const void *hw_context, bool state)
{
    ASSERT(hw_context != NULL);
    
    if (state) {
        return drv_eth_set_phy_reg_bit(hw_context, MDIO_REG0_BMCR, MDIO_REG0_BIT_LOOPBACK);
    } else {
        return drv_eth_clear_phy_reg_bit(hw_context, MDIO_REG0_BMCR, MDIO_REG0_BIT_LOOPBACK);
    }
}

