chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
static drv_eth_status_t drv_eth_set_phy_reg_bit(const void *hw_context, uint16_t reg, uint16_t mask)
{
    ASSERT(hw_context != NULL);
    ASSERT(reg <= 0x1F);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    uint16_t reg_value;
    int32_t result = mac_async_read_phy_reg(context->mac_desc, context->phy_address, reg, &reg_value);
    if (result == ERR_NONE) {
        reg_value |= mask;
        result = mac_async_write_phy_reg(context->mac_desc, context->phy_address, reg, reg_value);
    }
    
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_clear_phy_reg_bit(const void *hw_context, uint16_t reg, uint16_t mask)
{
    ASSERT(hw_context != NULL);
    ASSERT(reg <= 0x1F);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    uint16_t reg_value;
    int32_t result = mac_async_read_phy_reg(context->mac_desc, context->phy_address, reg, &reg_value);
    if (result == ERR_NONE) {
        reg_value &= ~mask;
        result = mac_async_write_phy_reg(context->mac_desc, context->phy_address, reg, reg_value);
    }
    
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_register_callback(const void *hw_context, drv_eth_cb_type_t type, drv_eth_callback_t callback)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    // Store callback for future use
    if (type == DRV_ETH_CB_RECEIVE) {
        context->receive_callback = callback;
        // Register with ASF4 MAC
        int32_t result = mac_async_register_callback(context->mac_desc, MAC_ASYNC_RECEIVE_CB, (FUNC_PTR)callback);
        return convert_error_code(result);
    } else if (type == DRV_ETH_CB_TRANSMIT) {
        context->transmit_callback = callback;
        // Register with ASF4 MAC  
        int32_t result = mac_async_register_callback(context->mac_desc, MAC_ASYNC_TRANSMIT_CB, (FUNC_PTR)callback);
        return convert_error_code(result);
    }
    
    return DRV_ETH_STATUS_ERROR;
}

static drv_eth_status_t drv_eth_write(const void *hw_context, const uint8_t *data, uint32_t length)
{
    ASSERT(hw_context != NULL);
    ASSERT(data != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_write(context->mac_desc, (uint8_t *)data, length);
    return convert_error_code(result);
}

/* GMAC hardware initialization functions */

static void gmac_clock_init(void)
{
    hri_mclk_set_AHBMASK_GMAC_bit(MCLK);
    hri_mclk_set_APBCMASK_GMAC_bit(MCLK);
    printf("[ETH] GMAC clocks enabled\r\n");
}

static void gmac_pin_init(void)
{
    gpio_set_pin_function(PC11, PINMUX_PC11L_GMAC_GMDC);
    gpio_set_pin_function(PC12, PINMUX_PC12L_GMAC_GMDIO);
    gpio_set_pin_function(PA13, PINMUX_PA13L_GMAC_GRX0);
    gpio_set_pin_function(PA12, PINMUX_PA12L_GMAC_GRX1);
    gpio_set_pin_function(PC20, PINMUX_PC20L_GMAC_GRXDV);
    gpio_set_pin_function(PA15, PINMUX_PA15L_GMAC_GRXER);
    gpio_set_pin_function(PA18, PINMUX_PA18L_GMAC_GTX0);
    gpio_set_pin_function(PA19, PINMUX_PA19L_GMAC_GTX1);
    gpio_set_pin_function(PA14, PINMUX_PA14L_GMAC_GTXCK);
    gpio_set_pin_function(PA17, PINMUX_PA17L_GMAC_GTXEN);
    printf("[ETH] GMAC pins configured\r\n");
}

/* GMAC and link monitoring functions moved from webserver_tasks.c */


/**
 * \brief Callback for GMAC interrupt.
 * Give semaphore for which gmac_task waits
 */
static void gmac_handler_cb(void)
{
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    BaseType_t xGMACTaskWoken = pdFALSE;
    
    /* Use ISR-safe semaphore give function */
    xSemaphoreGiveFromISR(context->gmac_dev.rx_sem.sem, &xGMACTaskWoken);
    
    /* Perform context switch if higher priority task was woken */
    portYIELD_FROM_ISR(xGMACTaskWoken);
}

/**
 * \brief Task for GMAC.
 * Waits for GMAC interrupt and begins processing of received packets
 */
static void gmac_task(void *pvParameters)
{
    gmac_device *ps_gmac_dev = pvParameters;

    while (1) {
        /* Wait for the counting RX notification semaphore. */
        sys_sem_wait(&ps_gmac_dev->rx_sem);

        /* Process the incoming packet. */
        ethernetif_mac_input(ps_gmac_dev->netif);
    }
}

/**
 * \brief Link monitoring task
 * Periodically checks PHY link status and notifies lwIP of changes
 */
static void link_monitor_task(void *p)
{
    (void)p;
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    bool current_link_state = false;
    bool previous_link_state = false;
    
    /* Wait for network initialization to complete */
    vTaskDelay(2000);
    
    /* Get initial link state */
    hw_eth_get_link_status(&eth_communication, &previous_link_state);
    
    for (;;) {
        /* Check current link status */
        drv_eth_status_t phy_result = hw_eth_get_link_status(&eth_communication, &current_link_state);
        if (phy_result == DRV_ETH_STATUS_OK) {
            /* Detect link status changes */
            if (current_link_state != previous_link_state) {
                printf("[LINK_MONITOR] Link state change detected: %s -> %s\r\n",
                       previous_link_state ? "UP" : "DOWN",
                       current_link_state ? "UP" : "DOWN");
                
                /* Update lwIP network interface link status */
                if (current_link_state) {
                    netif_set_link_up(&TCPIP_STACK_INTERFACE_0_desc);
                    printf("[LINK_MONITOR] Notified lwIP: Link UP\r\n");
                    
                    /* Don't restart auto-negotiation - let it stabilize naturally */
                    printf("[LINK_MONITOR] Link UP - allowing stabilization\r\n");
                } else {
                    netif_set_link_down(&TCPIP_STACK_INTERFACE_0_desc);
                    printf("[LINK_MONITOR] Notified lwIP: Link DOWN\r\n");
                }
                
                /* Update context link state */
                context->link_up = current_link_state;
                previous_link_state = current_link_state;
            }
        } else {
            printf("[LINK_MONITOR] Failed to read PHY link status (error: %d)\r\n", phy_result);
            
